/*
 * dosxe.c
 *
 * Functions for accessing Atari DOS XE file systems.
 *
 * Copyright 2023
 * Preston Crow
 *
 * Released under the GPL version 2.0
 *
 * Notes:
 *
 * References for the DOS XE structure:
 *
 * Page 67:
 *  https://atarionline.pl/biblioteka/materialy_ksiazkowe/Atari%20DOS%20XE%20Owner's%20manual.pdf
 *
 * https://forums.atariage.com/topic/354568-dos-xe-technical-details-sector-1-vtoc-etc/
 *
 * Percom block: ("Option Table Table 2"):
 * https://www.atarimax.com/freenet/freenet_material/5.8-BitComputersSupportArea/7.TechnicalResourceCenter/showarticle.php?75
 *
 * DOS XE treats all disks as having 256-byte sectors, using pairs on
 * 128-byte disks.  With everything memory mapped here, that's easy.  While
 * DOS XE often refers to these as "sectors," I use the term "cluster" in
 * the code for clarity.
 *
 * With single-density, clusters start on even numbers, so sector 720 can't
 * be used.  My sample image seems to only use through cluster 352, which
 * would be through sector 705.
 *
 * DOS XE has a signature at the end of each cluster which is an
 * extended version of the check with file numbers at the end of DOS 2
 * data sectors, but it applies to directories and other cluster types, too.
 *
 * On a single-density disk:
 *   physical sectors 1-3: boot sectors
 *   physical sectors 4-7: blank and unused
 *   physical sectors 8-9: cluster 4, VTOC
 *   physical sectors 10-11: cluster 5, main directory
 *
 * On other file systems, it's easy to identify a file or directory with a
 * single unique number.  For DOS 2/MyDOS, the starting sector number works
 * great.  For Sparta DOS, there's the sector number of the first map
 * sector.  But here, you need the directory entry that points to them, as
 * that's where you find the list of sector maps.  So you need the cluster
 * number of the start of the directory and the entry number within that
 * directory.  So for inodes, use cccceeee for the cluster number and the
 * entry number within that directory.  We could use the cluster number
 * where the entry is found, so the entry number would be 0-4, but that's
 * probably less useful.  In the code, we'll probably just be passing
 * pointers to the entry around.
 */

#include FUSE_INCLUDE
#include <sys/stat.h>
#include <stddef.h>
#include <stdio.h>
#include <errno.h>
#include <string.h>
#include <stdlib.h>
#ifdef __linux__
#include <linux/fs.h> // Linux-only options; fix if supported elsewhere
#else
#define RENAME_NOREPLACE  0
#define RENAME_EXCHANGE 0
#endif
#include <time.h>
#include "atrfs.h"

/*
 * Macros and defines
 */
#define CLUSTER_TO_SEC(n) (atrfs.sectorsize==128?(n)*2:(n))
#define CLUSTER(n) SECTOR(atrfs.sectorsize==128?(n)*2:(n)) // 256-byte logical sector
// Note: It may format a disk to not use all available clusters at the end
// It seems to ignore several clusters at the end of AT810 images, so MAX_PHYSCIAL_CLUSTERS > MAX_CLUSTERS
#define MAX_PHYSICAL_CLUSTER (atrfs.sectorsize==128?(atrfs.sectors-1)/2:atrfs.sectors)
#define MAX_CLUSTER (BYTES2(((struct dosxe_vtoc_cluster *)CLUSTER(4))->total_clusters)-1)
#define VTOC_CLUSTER 4
#define VTOC_CLUSTERS        (((MAX_PHYSICAL_CLUSTER+7) / 8 + 10 + 255)/256)
#define DATE_TO_YEAR(n)      (((n)[0])>>1)
#define DATE_TO_4YEAR(n)     (DATE_TO_YEAR(n)+(DATE_TO_YEAR(n)<87?2000:1900))
#define DATE_TO_MONTH(n)     ( ((((n)[0])&0x01)<<3) | (((n)[1])>>5) )
#define DATE_TO_DAY(n)       (((n)[1])&0x1f)
#define DATE_PRINT_FORMAT    "%d/%d/%d"
#define DATE_PRINT_FIELDS(n) DATE_TO_MONTH(n),DATE_TO_DAY(n),DATE_TO_4YEAR(n)
#define ROOT_DIR_CLUSTER     (((struct sector1_dosxe *)SECTOR(1))->main_directory)
#define ROOT_DIR             CLUSTER(ROOT_DIR_CLUSTER)

/*
 * File System Structures
 */
struct sector1_dosxe {
   // Initial fields used by the OS to boot
   unsigned char pad_zero; // 'X' for DOS XE
   unsigned char boot_sectors; // Usually 3, 1 if 512-byte sectors
   unsigned char boot_addr[2]; // Where to load the boot sectors in memory
   unsigned char dos_ini[2]; // JSR here at the end
   unsigned char jmp; // Normally 0x4C, but could be start of code (MyDOS/DOS 2)
   unsigned char exec_addr[2]; // execute address after boot sectors loaded ([0] is 8)
   unsigned char open_files; // default 3
   unsigned char active_drives; // bitmap like DOS 2; default 3
   unsigned char pad_zero_0b; // 00 at offset 0x0b
   unsigned char buffer_base_addr[2]; // 0x1484 or something like that
   unsigned char date_code[2]; // When disk was formatted or DOS written
   // Next 0x20 describe the disk/drive
   unsigned char disk_type[6]; // ASCII padded with zeros; e.g. AT810
   unsigned char unknown_16; // 0x01 ?
   unsigned char unknown_17; // 0x01 ?
   unsigned char total_clusters[2]; // plus 1
   unsigned char max_free_clusters[2];
   unsigned char first_vtoc_byte; // 0x07 if one VTOC cluster >>1 for each additional
   unsigned char main_directory; // 0x05 if only one VTOC cluster
   unsigned char sio_routine[2]; // df32 ?
   unsigned char unknwon_20[2]; // 5d 0d
   unsigned char sio_read_cmd; // 'R' or 'R'|0x80 for fast mode
   unsigned char sio_write_cmd; // 'W' or 'W'|0x80 for fast mode, maybe 'P'
   unsigned char pokey_baud[2]; // AUDF3/4 for baud rate, 00 00 standard, 28 10 fast
   unsigned char sio_format_cmd; // '!' possibly +128 for turbo interleave or 00 for ramdisk
   unsigned char unknwon_27; // 0x28 ? Format timeout value?
   // First 8 bytes of PERCOM disk parameters
   unsigned char tracks;    // 0x28 for 40 tracks (810 value)
   unsigned char step_rate; // 0x00 for 30 msecs (810 value)
   unsigned char sectors_per_track[2]; // 00 12 for 18 (reverse byte order)
   unsigned char sides;     // 0x00 for 1, 0x01 for 2
   unsigned char density;   // 0x00 for single, 0x04 for double
   unsigned char sector_size[2]; // 00 80 for 128 (reverse byte order)
   // Code follows at 0x30
};

struct cluster_label {
   unsigned char file_id_number[2]; // 0000 for root directory
   unsigned char volume_number[2];
   unsigned char sequence[2];
   // if ( sequence[1] == 0xff ) it's a directory and only use sequence[0]
   // if ( sequence[1] & 0x80 ) it's a file map cluster and only use sequence[0]
   // else sequence is BYTES2(sequence)
};

/*
 * Directory entries are 49 bytes!  That's four per cluster, plus a label
 *
 * Date: 7 bits for year (00-99), 4 bits for month (1-12), 5 bits day (1-31)
 * Time: Not saved
 */
struct dosxe_dir_entry {
   unsigned char status;
   char file_name[8];
   char file_ext[3];
   unsigned char file_clusters[2]; // Does not include last cluster
   unsigned char bytes_in_last_cluster; // 00 and ignored for a directory
   unsigned char file_sequence_number[2];
